name: "softmax_sampling"
backend: "python"
input {
  name: "item_id"
  data_type: TYPE_INT32
  dims: [ -1 ]
}
input {
  name: "click/binary_classification_task"
  data_type: TYPE_FP32
  dims: [ -1, 1 ]
}
output {
  name: "ordered_ids"
  data_type: TYPE_INT32
  dims: [ -1 ]
}
output {
  name: "ordered_scores"
  data_type: TYPE_FP32
  dims: [ -1 ]
}
